// ignore_for_file: constant_identifier_names

// General Errors
const INTERNET_CONNECTION_ERROR =
    'ظاهرا اینترنت شما متصل نیست و یا اختلال دارد!';
const GENERAL_ERROR =
    'در حال حاضر خطایی پیش آمده است. در صورت نیاز، با پشتیبانی ارتباط بر قرار کنید';

const TOKEN_ERROR =
    'مدت زمان حضور شما در اپ به پایان رسیده و لطفا مجدد وارد شوید!';

const SERVER_ERROR =
    'سرور در حال بروزرسانی می باشد. در صورت نیاز با پشتیبانی ارتباط برقرار کنید!';

const TOO_MANY_REQUESTS_ERROR =
    'درخواست های بیش از حد به سمت سرور ارسال کرده اید. لحظاتی دیگر تلاش کنید!';

const TIMEOUT_ERROR =
    'درخواست بیشتر از حالت عادی طول کشید. لطفا لحظاتی دیگر تلاش کنید!';

const No_Access_ERROR =
    'شما اجازه دسترسی به این بخش را ندارید، در صورت نیاز با پشتیبانی ارتباط برقرار کنید!';
